PQSolutionsPeru/ESP32-IDF/APP/HDD1_2/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
            if (get_relay_manager_initialized()) {
                uint32_t total_interrupts = 0;
                relay_manager_get_interrupt_stats(&total_interrupts, NULL, NULL);
                printf("Relay interrupts: %lu total\n", total_interrupts);
            }
            printf("\n");
        }
        else if (strcmp(rx_buffer, "spiffs_check") == 0) {
            printf("\n=== SPIFFS STATUS ===\n");
            size_t total = 0, used = 0;
            esp_err_t ret = esp_spiffs_info(NULL, &total, &used);
            if (ret == ESP_OK) {
                printf("Total: %zu KB\n", total / 1024);
                printf("Used: %zu KB\n", used / 1024);
                printf("Free: %zu KB\n", (total - used) / 1024);
                printf("Usage: %.1f%%\n", (float)used / total * 100.0);
            } else {
                printf("ERROR: Cannot read SPIFFS info: %s\n", esp_err_to_name(ret));
                printf("This may indicate SPIFFS corruption!\n");
            }
            printf("\n");
        }
        else if (strcmp(rx_buffer, "spiffs_format") == 0) {
            printf("\n=== FORMAT SPIFFS WARNING ===\n");
            printf("This will DELETE ALL LOGS!\n");
            printf("Type 'spiffs_format_yes' to proceed\n\n");
        }
        else if (strcmp(rx_buffer, "spiffs_format_yes") == 0) {
            printf("\n=== FORCING SPIFFS FORMAT ===\n");

            // Desmontar SPIFFS primero
            esp_vfs_spiffs_unregister(NULL);

            // Formatear la partición
            esp_err_t ret = esp_spiffs_format(NULL);
            if (ret == ESP_OK) {
                printf("SPIFFS formatted successfully!\n");

                // Remontar
                esp_vfs_spiffs_conf_t conf = {
                    .base_path = "/spiffs",
                    .partition_label = NULL,
                    .max_files = 5,
                    .format_if_mount_failed = true
                };
                ret = esp_vfs_spiffs_register(&conf);
                if (ret == ESP_OK) {
                    printf("SPIFFS remounted successfully!\n");
                    printf("*** PLEASE RESTART THE ESP32 ***\n");
                } else {
                    printf("ERROR: Failed to remount SPIFFS: %s\n", esp_err_to_name(ret));
                }
            } else {
                printf("ERROR: Failed to format SPIFFS: %s\n", esp_err_to_name(ret));
            }
            printf("\n");
        }
    }
}

static void connectivity_event_callback(const connectivity_event_t *event, void *user_data) {
    if (!event) {
        return;
    }

    LOG_I(TAG, "Connectivity event detected: type=%d, panel=%s, stored_in_ram", 
          event->type, event->panel_name);
}

static void start_connectivity_monitoring_if_ready(void) {
    if (g_connectivity_monitor_started) {
        return;
    }
    
    if (!get_wifi_connected() || !get_mqtt_connected() || !get_relay_manager_initialized()) {
        return;
    }
    
    LOG_I(TAG, "System stable - starting connectivity monitoring");
    
    esp_err_t ret = connectivity_monitor_start();
    if (ret == ESP_OK) {
        g_connectivity_monitor_started = true;
        LOG_I(TAG, "Connectivity monitoring started successfully");
    } else {
        LOG_E(TAG, "Failed to start connectivity monitoring: %s", esp_err_to_name(ret));
    }
}

static void print_memory_info_simple(void) {
    size_t free_heap = esp_get_free_heap_size();
    size_t min_heap = esp_get_minimum_free_heap_size();
    
    LOG_I(TAG, "Memory: free=%zu min=%zu", free_heap, min_heap);
    
    if (g_watchdog_available) {
        watchdog_manager_report_activity(WATCHDOG_CHECK_MEMORY);
    }
}

static char* find_json_value(const char *json, const char *key, char *value_buf, size_t buf_size) {
    char search_key[64];
    snprintf(search_key, sizeof(search_key), "\"%s\":", key);
    
    char *start = strstr(json, search_key);
    if (!start) {
        return NULL;
    }
    
    start += strlen(search_key);
    while (*start == ' ' || *start == '\t') start++;
    
    if (*start == '"') {
        start++;
        char *end = strchr(start, '"');
        if (!end) return NULL;
        
        size_t len = end - start;
        if (len >= buf_size) len = buf_size - 1;
        
        memcpy(value_buf, start, len);
        value_buf[len] = '\0';
        return value_buf;
    } else {
        char *end = start;
        while (*end && *end != ',' && *end != '}' && *end != ' ') end++;
        
        size_t len = end - start;
        if (len >= buf_size) len = buf_size - 1;
        
        memcpy(value_buf, start, len);
        value_buf[len] = '\0';
        return value_buf;
    }
}

static bool parse_json_bool(const char *json, const char *key) {
    char value_buf[16];
    char *value = find_json_value(json, key, value_buf, sizeof(value_buf));
    if (!value) return false;
    
    return (strcmp(value, "true") == 0 || strcmp(value, "1") == 0);
}

static void process_pending_relay_configs(void) {
    if (g_pending_config_count == 0 || !get_relay_manager_initialized()) {
        return;
    }
    
    LOG_I(TAG, "Processing %d pending relay configurations", g_pending_config_count);
    
    bool relay_processed[RELAY_MANAGER_MAX_RELAYS] = {false};
    
    for (int i = 0; i < g_pending_config_count; i++) {
        if (g_watchdog_available) {
            watchdog_manager_feed();
        }
        
        char command_val[32], relay_id_val[32];
        
        if (find_json_value(g_pending_relay_configs[i], "command", command_val, sizeof(command_val)) &&
            find_json_value(g_pending_relay_configs[i], "relay_id", relay_id_val, sizeof(relay_id_val)) &&
            strcmp(command_val, "update_config") == 0) {
            
            int relay_num = -1;
            if (sscanf(relay_id_val, "relay_%d", &relay_num) == 1 && 
                relay_num >= 1 && relay_num <= RELAY_MANAGER_MAX_RELAYS) {
                
                int relay_index = relay_num - 1;
                
                if (relay_processed[relay_index]) {
                    LOG_W(TAG, "Relay %s already processed - skipping", relay_id_val);
                    continue;
                }
                
                relay_processed[relay_index] = true;
            }
            
            bool is_active = parse_json_bool(g_pending_relay_configs[i], "is_active");
            esp_err_t ret = relay_manager_set_active(relay_id_val, is_active);
            if (ret == ESP_OK) {
                LOG_I(TAG, "Relay %s %s", relay_id_val, is_active ? "ACTIVATED" : "DEACTIVATED");
                vTaskDelay(pdMS_TO_TICKS(50));
                
                char contact_type_val[16];
                if (find_json_value(g_pending_relay_configs[i], "contact_type", contact_type_val, sizeof(contact_type_val))) {
                    relay_contact_type_t type = (strcmp(contact_type_val, "NC") == 0) ? 
                                              RELAY_CONTACT_NC : RELAY_CONTACT_NO;
                    relay_manager_set_contact_type(relay_id_val, type);
                    LOG_I(TAG, "Relay %s contact type: %s", relay_id_val, contact_type_val);
                }
            } else {
                LOG_E(TAG, "Failed to activate relay %s", relay_id_val);
            }
        }
        vTaskDelay(pdMS_TO_TICKS(50));
    }
    
