PQSolutionsPeru/ESP32-IDF/APP/HDD1_2/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
    if (strcmp(topic, g_mqtt_temp_topic) == 0) {
        LOG_W(TAG, "Deletion notification received");
        
        config_manager_erase_key("client_id");
        config_manager_erase_key("panel_id");
        config_manager_erase_key("panel_name");
        config_manager_erase_key("location");
        mqtt_manager_clear_panel_config();
        mqtt_manager_cleanup_panel_subscriptions();
        
        if (get_relay_manager_initialized()) {
            relay_mgr_state_t state = relay_manager_get_mgr_state();
            if (state == RELAY_MGR_STATE_RUNNING) {
                relay_manager_deinit();
                set_relay_manager_initialized(false);
                vTaskDelay(pdMS_TO_TICKS(1000));
            }
        }
        
        time_manager_reset_network_info_sent();
        g_need_reregister = true;
        vTaskDelay(pdMS_TO_TICKS(500));
        mqtt_manager_send_network_info();
        return;
    }
    
    snprintf(g_mqtt_temp_topic, sizeof(g_mqtt_temp_topic), "esp32/config/%s", g_esp32_id_buffer);
    
    if (strcmp(topic, g_mqtt_temp_topic) == 0) {
        LOG_I(TAG, "Configuration message received");
        
        esp_err_t ret = process_esp32_configuration(data);
        
        if (ret == ESP_OK) {
            LOG_I(TAG, "Configuration accepted");
            
            if (!get_relay_manager_initialized()) {
                vTaskDelay(pdMS_TO_TICKS(200));
                LOG_I(TAG, "Initializing Relay Manager");
                ret = relay_manager_init();
                if (ret == ESP_OK) {
                    relay_manager_set_state_callback(relay_state_change_callback, NULL);
                    relay_manager_set_mqtt_callback(relay_mqtt_command_callback, NULL);
                    set_relay_manager_initialized(true);
                }
            }
        }
        return;
    }
    
    if (strstr(topic, "/relay_config")) {
        char expected_topic[MQTT_TOPIC_MAX_LENGTH];
        esp_err_t topic_ret = mqtt_manager_get_panel_topic(expected_topic, sizeof(expected_topic), "relay_config");
        
        if (topic_ret != ESP_OK || strcmp(topic, expected_topic) != 0) {
            LOG_W(TAG, "Relay config not for our panel - ignoring. Expected: %s, Got: %s", 
                  (topic_ret == ESP_OK) ? expected_topic : "UNKNOWN", topic);
            return;
        }
        
        static char last_relay_config[400] = {0};
        static int64_t last_relay_config_time = 0;
        int64_t current_time = esp_timer_get_time() / 1000;
        
        if (data_len < 400 && 
            strcmp(data, last_relay_config) == 0 && 
            (current_time - last_relay_config_time) < 2000) {
            LOG_W(TAG, "Duplicate relay config detected - ignoring");
            return;
        }
        
        if (data_len < 400) {
            memcpy(last_relay_config, data, data_len);
            last_relay_config[data_len] = '\0';
            last_relay_config_time = current_time;
        }
        
        if (!get_relay_manager_initialized() || !g_system_ready_for_relays) {
            LOG_W(TAG, "Relay config received but system not ready - queuing for later");
            
            if (g_pending_config_count < 5 && data_len < 400) {
                memcpy(g_pending_relay_configs[g_pending_config_count], data, data_len);
                g_pending_relay_configs[g_pending_config_count][data_len] = '\0';
                g_pending_config_count++;
                LOG_I(TAG, "Queued relay config %d/5", g_pending_config_count);
            } else {
                LOG_W(TAG, "Config queue full or message too large, dropping");
            }
            return;
        }
        
        relay_mgr_state_t mgr_state = relay_manager_get_mgr_state();
        if (mgr_state != RELAY_MGR_STATE_RUNNING) {
            LOG_W(TAG, "Relay manager not in running state (%d), delaying config", mgr_state);
            vTaskDelay(pdMS_TO_TICKS(500));
            
            if (relay_manager_get_mgr_state() != RELAY_MGR_STATE_RUNNING) {
                LOG_E(TAG, "Relay manager still not ready, ignoring config");
                return;
            }
        }
        
        if (data_len > 2000) {
            LOG_W(TAG, "Relay config message too large, ignoring");
            return;
        }
        
        char command_val[32], relay_id_val[32], is_active_val[16];
        char contact_type_val[16], custom_name_val[64];
        
        if (find_json_value(data, "command", command_val, sizeof(command_val)) &&
            find_json_value(data, "relay_id", relay_id_val, sizeof(relay_id_val)) &&
            strcmp(command_val, "update_config") == 0) {
            
            LOG_I(TAG, "Processing config for relay %s", relay_id_val);
            
            if (g_watchdog_available) {
                watchdog_manager_feed();
            }
            
            if (find_json_value(data, "is_active", is_active_val, sizeof(is_active_val))) {
                bool is_active = parse_json_bool(data, "is_active");
                
                esp_err_t ret = relay_manager_set_active(relay_id_val, is_active);
                if (ret == ESP_OK) {
                    LOG_I(TAG, "Relay %s %s", relay_id_val, is_active ? "ACTIVATED" : "DEACTIVATED");
                    vTaskDelay(pdMS_TO_TICKS(50));
                    
                    if (find_json_value(data, "contact_type", contact_type_val, sizeof(contact_type_val))) {
                        relay_contact_type_t type = (strcmp(contact_type_val, "NC") == 0) ? 
                                                  RELAY_CONTACT_NC : RELAY_CONTACT_NO;
                        esp_err_t type_ret = relay_manager_set_contact_type(relay_id_val, type);
                        if (type_ret == ESP_OK) {
                            LOG_I(TAG, "Relay %s contact type set to %s", relay_id_val, contact_type_val);
                            vTaskDelay(pdMS_TO_TICKS(50));
                        } else {
                            LOG_E(TAG, "Failed to set contact type for %s: %s", relay_id_val, esp_err_to_name(type_ret));
                        }
                    }
                    
                    if (find_json_value(data, "custom_name", custom_name_val, sizeof(custom_name_val))) {
                        if (strlen(custom_name_val) > 0 && strlen(custom_name_val) < 32) {
                            relay_manager_set_name(relay_id_val, custom_name_val);
                            LOG_I(TAG, "Relay %s name set to '%.30s'", relay_id_val, custom_name_val);
                        }
                    }
                    
                    vTaskDelay(pdMS_TO_TICKS(100));
                    relay_manager_report_initial_states();
                    
                } else {
                    LOG_E(TAG, "Failed to set active state for relay %s: %s", relay_id_val, esp_err_to_name(ret));
                    vTaskDelay(pdMS_TO_TICKS(500));
                    esp_err_t retry_ret = relay_manager_set_active(relay_id_val, is_active);
                    if (retry_ret == ESP_OK) {
                        LOG_I(TAG, "Retry successful for relay %s", relay_id_val);
                    } else {
                        LOG_E(TAG, "Retry failed for relay %s", relay_id_val);
                    }
                }
            }
        }
    }
}

static void mqtt_message_callback(const char *topic, const char *data, int data_len, void *user_data) {
    if (!topic || !data || data_len <= 0 || data_len >= 1024) {
        return;
    }
    
    if (g_watchdog_available) {
        watchdog_manager_report_activity(WATCHDOG_CHECK_MQTT);
    }
    
    deferred_mqtt_message_t msg = {0};
    strncpy(msg.topic, topic, sizeof(msg.topic) - 1);
    msg.topic[sizeof(msg.topic) - 1] = '\0';
    
