PQSolutionsPeru/ESP32-IDF/APP/HDD1_2/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
    memcpy(msg.data, data, data_len);
    msg.data[data_len] = '\0';
    msg.data_len = data_len;
    msg.pending = true;
    
    if (xQueueSend(g_mqtt_message_queue, &msg, 0) != pdTRUE) {
        deferred_mqtt_message_t dummy;
        if (xQueueReceive(g_mqtt_message_queue, &dummy, 0) == pdTRUE) {
            xQueueSend(g_mqtt_message_queue, &msg, 0);
        }
    }
}

static void mqtt_state_callback(mqtt_manager_state_t state, void *user_data) {
    switch (state) {
        case MQTT_MANAGER_STATE_CONNECTED:
            LOG_I(TAG, "MQTT connected");
            set_mqtt_connected(true);
            
            if (!get_relay_manager_initialized()) {
                LOG_I(TAG, "Initializing Relay Manager after MQTT connection");
                esp_err_t ret = relay_manager_init();
                if (ret == ESP_OK) {
                    relay_manager_set_state_callback(relay_state_change_callback, NULL);
                    relay_manager_set_mqtt_callback(relay_mqtt_command_callback, NULL);
                    set_relay_manager_initialized(true);
                    
                    vTaskDelay(pdMS_TO_TICKS(1000));
                    g_system_ready_for_relays = true;
                    
                    process_pending_relay_configs();
                    
                    vTaskDelay(pdMS_TO_TICKS(500));
                    relay_manager_detect_post_restart_changes();
                    
                    LOG_I(TAG, "Relay Manager initialized and ready for configurations");
                } else {
                    LOG_E(TAG, "Failed to initialize Relay Manager: %s", esp_err_to_name(ret));
                }
            } else {
                g_system_ready_for_relays = true;
                process_pending_relay_configs();
            }
            
            start_connectivity_monitoring_if_ready();
            
            vTaskDelay(pdMS_TO_TICKS(2000));
            
            LOG_I(TAG, "Checking for pending RAM connectivity events after MQTT connection");
            
            int event_count = connectivity_monitor_get_pending_event_count();
            bool has_events = connectivity_monitor_has_pending_ram_events();
            
            LOG_I(TAG, "Event count: %d, has_events: %s", event_count, has_events ? "true" : "false");
            
            if (has_events || event_count > 0) {
                LOG_I(TAG, "Processing stored RAM connectivity events (count: %d)", event_count);
                
                for (int retry = 0; retry < 3; retry++) {
                    esp_err_t ram_ret = connectivity_monitor_process_pending_events();
                    if (ram_ret == ESP_OK) {
                        LOG_I(TAG, "RAM connectivity events processed successfully on attempt %d", retry + 1);
                        break;
                    } else {
                        LOG_W(TAG, "Failed to process RAM events on attempt %d: %s", retry + 1, esp_err_to_name(ram_ret));
                        if (retry < 2) {
                            vTaskDelay(pdMS_TO_TICKS(1000));
                        }
                    }
                }
                
                int remaining_count = connectivity_monitor_get_pending_event_count();
                LOG_I(TAG, "Events remaining after processing: %d", remaining_count);
            } else {
                LOG_I(TAG, "No RAM connectivity events to process");
            }
            
            vTaskDelay(pdMS_TO_TICKS(1000));
            mqtt_manager_send_network_info();
            
            if (g_watchdog_available) {
                watchdog_manager_report_activity(WATCHDOG_CHECK_MQTT);
                
                if (get_wifi_connected() && get_mqtt_connected()) {
                    static bool watchdog_configured = false;
                    if (!watchdog_configured) {
                        vTaskDelay(pdMS_TO_TICKS(3000));
                        
                        if (get_relay_manager_initialized()) {
                            esp_err_t result = watchdog_manager_set_mode(WATCHDOG_MODE_RUNNING);
                            if (result == ESP_OK) {
                                watchdog_configured = true;
                                LOG_I(TAG, "Watchdog safely transitioned to running mode");
                            }
                        }
                    }
                }
            }
            
            if (strlen(g_esp32_id_buffer) > 0) {
                snprintf(g_mqtt_temp_topic, sizeof(g_mqtt_temp_topic), "esp32/config/%s", g_esp32_id_buffer);
                mqtt_manager_subscribe(g_mqtt_temp_topic, 2);
                
                snprintf(g_mqtt_temp_topic, sizeof(g_mqtt_temp_topic), "esp32/notify/%s/deleted", g_esp32_id_buffer);
                mqtt_manager_subscribe(g_mqtt_temp_topic, 2);
                
                LOG_I(TAG, "Suscrito a topics generales del ESP32");
            }
            
            wifi_manager_state_t wifi_state = wifi_manager_get_state();
            if (wifi_state == WIFI_MANAGER_STATE_STA_AP_MODE && 
                wifi_manager_is_connected() && mqtt_manager_is_connected()) {
                
                vTaskDelay(pdMS_TO_TICKS(5000));
                
                if (wifi_manager_is_connected() && mqtt_manager_is_connected()) {
                    LOG_I(TAG, "WiFi and MQTT stable - switching to STA mode only");
                    wifi_manager_set_sta_mode();
                }
            }
            break;
            
        case MQTT_MANAGER_STATE_DISCONNECTED:
            LOG_I(TAG, "MQTT disconnected");
            set_mqtt_connected(false);
            
            if (g_watchdog_available) {
                esp_err_t ret = watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);
                if (ret != ESP_OK) {
                    LOG_D(TAG, "Could not set watchdog to config mode");
                }
            }
            break;
            
        case MQTT_MANAGER_STATE_ERROR:
            LOG_W(TAG, "MQTT error");
            set_mqtt_connected(false);
            break;
            
        default:
            break;
    }
}

static void wifi_state_callback(wifi_manager_state_t state, void *user_data) {
    switch (state) {
        case WIFI_MANAGER_STATE_CONNECTED:
            LOG_I(TAG, "WiFi connected");
            set_wifi_connected(true);
            
            if (g_watchdog_available) {
                watchdog_manager_report_activity(WATCHDOG_CHECK_WIFI);
            }
            
            time_manager_sync_time();
            
            if (esp32_id_manager_get_id(g_esp32_id_buffer, sizeof(g_esp32_id_buffer)) == ESP_OK) {
                if (mqtt_manager_set_esp32_id(g_esp32_id_buffer) == ESP_OK) {
                    mqtt_manager_connect();
                }
            }
            
            start_connectivity_monitoring_if_ready();
            break;
            
        case WIFI_MANAGER_STATE_DISCONNECTED:
            LOG_I(TAG, "WiFi disconnected");
            set_wifi_connected(false);
            set_mqtt_connected(false);
            
            if (g_watchdog_available) {
                esp_err_t ret = watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);
                if (ret != ESP_OK) {
                    LOG_D(TAG, "Could not set watchdog to config mode");
                }
            }
            break;
            
