PQSolutionsPeru/ESP32-IDF/APP/HDD1_2/ESP-IDF-HDDESP32/hddesp32/main/hddesp32_main.c
            if (mqtt_connected) {
                if (g_watchdog_available) {
                    watchdog_manager_report_activity(WATCHDOG_CHECK_MQTT);
                }
                
                if (cycle_count % 1800 == 0) {
                    LOG_I(TAG, "System OK - WiFi+MQTT connected");
                }
            } else {
                if (cycle_count % 36 == 0) {
                    if (cycle_count % 1800 == 0) {
                        LOG_I(TAG, "Retrying MQTT connection");
                    }
                    if (esp32_id_manager_get_id(g_esp32_id_buffer, sizeof(g_esp32_id_buffer)) == ESP_OK) {
                        mqtt_manager_set_esp32_id(g_esp32_id_buffer);
                        mqtt_manager_connect();
                    }
                }
            }
        } else {
            connection_stable_start = 0;
            
            if (cycle_count % 10 == 0) {
                LOG_I(TAG, "WiFi disconnected - running recovery cycle");
                wifi_manager_handle_disconnection("FirePanel", "firepanel", 10);
            }
        }
        
        if (g_watchdog_available && cycle_count % 90 == 0) {
            watchdog_health_status_t health = watchdog_manager_check_system_health();
            if (health > WATCHDOG_HEALTH_WARNING) {
                LOG_W(TAG, "System health degraded: %d", health);
            }
        }
        
        vTaskDelay(pdMS_TO_TICKS(2000));
    }
}

void app_main(void)
{
    ESP_ERROR_CHECK(log_storage_init());
    
    size_t log_size, prev_log_size;
    if (log_storage_get_info(&log_size, &prev_log_size) == ESP_OK) {
        ESP_LOGI(TAG, "Log system ready - current: %zu bytes, previous: %zu bytes", 
                 log_size, prev_log_size);
    }
    
    esp_log_set_vprintf(spiffs_vprintf);

    uart_config_t uart_config = {
        .baud_rate = 115200,
        .data_bits = UART_DATA_8_BITS,
        .parity = UART_PARITY_DISABLE,
        .stop_bits = UART_STOP_BITS_1,
        .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
        .source_clk = UART_SCLK_DEFAULT,
    };

    uart_param_config(UART_NUM_0, &uart_config);
    uart_driver_install(UART_NUM_0, 512, 0, 0, NULL, 0);

    LOG_I(TAG, "Starting HDD ESP32 Monitor v2.0 (ESP-IDF v5.4.1)");
    LOG_I(TAG, "UART driver initialized for debug commands");

    LOG_I(TAG, "Phase 1: Basic initialization");

    g_callback_mutex = xSemaphoreCreateMutex();
    g_global_state_mutex = xSemaphoreCreateMutex();
    
    g_mqtt_message_queue = xQueueCreate(8, sizeof(deferred_mqtt_message_t));
    if (g_mqtt_message_queue == NULL) {
        LOG_E(TAG, "Failed to create MQTT message queue");
        esp_restart();
    }
    
    esp_err_t watchdog_ret = watchdog_manager_init();
    if (watchdog_ret != ESP_OK) {
        LOG_E(TAG, "Failed to initialize watchdog manager: %s", esp_err_to_name(watchdog_ret));
        
        LOG_W(TAG, "Retrying watchdog initialization after delay...");
        vTaskDelay(pdMS_TO_TICKS(3000));
        
        watchdog_ret = watchdog_manager_init();
        if (watchdog_ret != ESP_OK) {
            LOG_E(TAG, "Watchdog initialization failed twice: %s", esp_err_to_name(watchdog_ret));
            LOG_E(TAG, "CRITICAL: System cannot function safely without watchdog");
            vTaskDelay(pdMS_TO_TICKS(5000));
            esp_restart();
        }
    }
    
    LOG_I(TAG, "Watchdog manager initialized successfully");
    g_watchdog_available = true;
    
    watchdog_manager_set_event_callback(watchdog_event_callback, NULL);
    
    vTaskDelay(pdMS_TO_TICKS(1000));
    
    bool main_task_registered = false;
    int main_reg_attempts = 0;
    while (!main_task_registered && main_reg_attempts < 5) {
        esp_err_t reg_ret = watchdog_manager_register_task(NULL, "app_main");
        if (reg_ret == ESP_OK) {
            LOG_I(TAG, "Main task registered in watchdog manager");
            main_task_registered = true;
        } else {
            LOG_W(TAG, "Main task registration attempt %d failed: %s", 
                    main_reg_attempts + 1, esp_err_to_name(reg_ret));
            main_reg_attempts++;
            vTaskDelay(pdMS_TO_TICKS(1000));
        }
    }
    
    if (!main_task_registered) {
        LOG_E(TAG, "CRITICAL: Could not register main task in watchdog");
        esp_restart();
    }
    
    ESP_ERROR_CHECK(config_manager_init());
    if (main_task_registered) {
        esp_err_t feed_ret = watchdog_manager_feed();
        if (feed_ret != ESP_OK) {
            LOG_W(TAG, "Initial watchdog feed failed: %s", esp_err_to_name(feed_ret));
        }
    }

    // Verificar boot loop
    if (config_manager_check_boot_loop() != ESP_OK) {
        LOG_E(TAG, "BOOT LOOP DETECTED - ENTERING SAFE MODE");
        watchdog_manager_set_mode(WATCHDOG_MODE_CONFIG);
        // No inicializar relay_manager para prevenir más reinicios
        while(1) {
            vTaskDelay(pdMS_TO_TICKS(10000));
        }
    }

    ESP_ERROR_CHECK(esp32_id_manager_init());
    if (main_task_registered) {
        watchdog_manager_feed();
    }
    
    ESP_ERROR_CHECK(esp32_id_manager_get_id(g_esp32_id_buffer, sizeof(g_esp32_id_buffer)));
    LOG_I(TAG, "ESP32 ID: %s", g_esp32_id_buffer);
    log_uploader_start(g_esp32_id_buffer);
    
    char mac_address[ESP32_MAC_STR_LENGTH + 1];
    ESP_ERROR_CHECK(esp32_id_manager_get_mac(mac_address, sizeof(mac_address)));
    LOG_I(TAG, "MAC: %s", mac_address);
    
    if (main_task_registered) {
        watchdog_manager_feed();
    }
    
    setup_emergency_debug_support();
    
    LOG_I(TAG, "Phase 2: Manager initialization");
    
    ESP_ERROR_CHECK(wifi_manager_init());
    if (main_task_registered) {
        watchdog_manager_feed();
    }
    
    ESP_ERROR_CHECK(time_manager_init());
    if (main_task_registered) {
        watchdog_manager_feed();
    }
    
    ESP_ERROR_CHECK(mqtt_manager_init());
    if (main_task_registered) {
        watchdog_manager_feed();
    }
    
    esp_err_t conn_ret = connectivity_monitor_init();
    if (conn_ret != ESP_OK) {
        LOG_E(TAG, "Failed to initialize connectivity monitor: %s", esp_err_to_name(conn_ret));
    } else {
        LOG_I(TAG, "Connectivity monitor initialized");
        connectivity_monitor_set_event_callback(connectivity_event_callback, NULL);
    }
    
